p2pbybinding.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p2p="http://engine.paymentgate.ru/webservices/p2p">
    <soapenv:Header/>
    <soapenv:Body>
        <p2p:performP2PByBinding>
            <arg0 language="?" ip="?" email="?" phone="?" type="?" threeDSMethodNotificationUrl="?">
                <orderId>?</orderId>
                <!--Optional:-->
                <fromCard>
                    <!--Optional:-->
                    <bindingId>?</bindingId>
                    <!--Optional:-->
                    <pan>?</pan>
                    <!--Optional:-->
                    <cvc>?</cvc>
                    <!--Optional:-->
                    <expirationYear>?</expirationYear>
                    <!--Optional:-->
                    <expirationMonth>?</expirationMonth>
                    <!--Optional:-->
                    <cardholderName>?</cardholderName>
                    <!--Optional:-->
                    <threeDsAuthResult cavv="?" xid="?" eci="?" authenticationTypeIndicator="?"/>
                    <!--Optional:-->
                    <seToken>?</seToken>
                    <!--Optional:-->
                    <vendor>?</vendor>
                    <!--Optional:-->
                    <paymentToken>?</paymentToken>
                </fromCard>
                <!--Optional:-->
                <toCard>
                    <!--Optional:-->
                    <bindingId>?</bindingId>
                    <!--Optional:-->
                    <pan>?</pan>
                    <!--Optional:-->
                    <cvc>?</cvc>
                    <!--Optional:-->
                    <expirationYear>?</expirationYear>
                    <!--Optional:-->
                    <expirationMonth>?</expirationMonth>
                    <!--Optional:-->
                    <cardholderName>?</cardholderName>
                    <!--Optional:-->
                    <threeDsAuthResult cavv="?" xid="?" eci="?" authenticationTypeIndicator="?"/>
                    <!--Optional:-->
                    <seToken>?</seToken>
                    <!--Optional:-->
                    <vendor>?</vendor>
                    <!--Optional:-->
                    <paymentToken>?</paymentToken>
                </toCard>
                <!--Optional:-->
                <amountInput>?</amountInput>
                <!--Zero or more repetitions:-->
                <params name="?" value="?"/>
                <!--Optional:-->
                <threeDSServerTransId>?</threeDSServerTransId>
                <!--Optional:-->
                <threeDSVer2FinishUrl>?</threeDSVer2FinishUrl>
                <!--Optional:-->
                <threeDSSDK>?</threeDSSDK>
                <!--Optional:-->
                <captcha>?</captcha>
                <!--Optional:-->
                <currency>?</currency>
                <!--Optional:-->
                <threeDSSDKEncData>?</threeDSSDKEncData>
                <!--Optional:-->
                <threeDSSDKReferenceNumber>?</threeDSSDKReferenceNumber>
                <!--Optional:-->
                <threeDSSDKEphemPubKey>?</threeDSSDKEphemPubKey>
                <!--Optional:-->
                <threeDSSDKAppId>?</threeDSSDKAppId>
                <!--Optional:-->
                <threeDSSDKTransId>?</threeDSSDKTransId>
                <!--Optional:-->
                <billingPayerData>
                    <!--Optional:-->
                    <billingAddressLine1>?</billingAddressLine1>
                    <!--Optional:-->
                    <billingAddressLine2>?</billingAddressLine2>
                    <!--Optional:-->
                    <billingAddressLine3>?</billingAddressLine3>
                    <!--Optional:-->
                    <billingCity>?</billingCity>
                    <!--Optional:-->
                    <billingCountry>?</billingCountry>
                    <!--Optional:-->
                    <billingPostalCode>?</billingPostalCode>
                    <!--Optional:-->
                    <billingState>?</billingState>
                </billingPayerData>
            </arg0>
        </p2p:performP2PByBinding>
    </soapenv:Body>
</soapenv:Envelope>